Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=620_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Nimeni on Johanna Njaita ja olen 22-vuotias.
sme: Mu namma lea Johanna Njaita ja lean 22-jahkásaš.

source: Tulen Ruotsista eteläsaamen alueelta pienestä kylästä nimeltä Hemavan.
sme: Boađán Ruoŧas lullisápmelaččaid guovllus unna gilážis man namma lea Hemavan.

source: Se sijaitsee kahdenkymmenen kilometrin päässä Tärnabystä.
sme: Dat lea guoktelogi kilomehtera geahčen Deartnas.

source: Olen itse uumajansaamelainen, mutta olen opiskellut eteläsaamea ensimmäiseltä luokalta lähtien Tärnabyn saamelaiskoulussa.
sme: Lean ieš ubmisápmelaš, muhto lean studeren lullisámegiela vuosttas luohká rájes Deartna sámeskuvllas.

source: Koulussa ei ollut uumajansaamen opettajaa, joten emme voineet opiskella omaa kieltämme.
sme: Skuvllas ii lean ubmisámegiela oahpaheaddji, nu ahte mii eat sáhttán lohkat iežamet giela.

source: Uumajansaame on erittäin pieni ja uhanalainen kieli ja sen puhujia ei ole montaa.
sme: Ubmisámegiella lea hui unna ja áitatvuloš giella eaige dan hállit leat máŋga.

source: Tällä hetkellä asun Jokkmokkissa, jossa opiskelen Sámij åhpadusguovdásjissa (saamelaisten koulutuskeskus), keskittyen nahkaan ja tekstiileihin.
sme: Dál orun Johkamohkis gos mun studeren Sámij åhpadusguovdásj is siste- ja dipmadujiid.

source: Sámij åhpadusguovdásjiin meno on antanut minulle paljon, sillä olen oppinut paljon perinteisistä käsitöistä.
sme: Sámij åhpadusguovdásj lea addán munnje olu, danin go lean oahppan ollu árbevirolaš dujiin.

source: Täällä oppii myös paljon saamelaisten historiasta ja muista saamelaisalueista, sekä saamelaisista perinteistä.
sme: Dáppe oahppá maiddái ollu sámiid historjjá, eará sámeguovlluid ja sámiid árbevieruid birra.

source: Ennen kun aloitin opiskeluni Sámij åhpadusguovdásjissa, opiskelin Sollefteåssa, joka sijaitsee Ruotsin keskiosassa.
sme: Ovdalgo álggahin oahpuid Sámij åhpadusguovdásjis studerejin Sollefteås, Gaska-Ruoŧas.

source: Siellä opiskelin saamelaiskäsitöiden muotoilua ja Alpine linea. Kuäydessäni saamelaiskäsityökoulua, minulla ei ollut saamelaisia opettajia, vaan minun täytyi usein soittaa äidille kotiin ja kysyä mitä ja miten pitää jokin tehdä.
sme: Doppe studerejin sámedujiid hábmema ja Alpine line ’ a. Go vázzen sámeduodjeskuvlla mus ii lean sápmelaš oahpaheaddji, muhto fertejin baicce riŋget dávjá eadnái ruoktot ja jearrat maid ja mo juoga galgá dahkkot.

source: Opiskelun aloittaminen Jokkmokkissa vaikutti minuun siten, että kehityin siellä huomattavasti erityisesti käsityön saralla, sillä siellä oli saamelaisia opettajia.
sme: Oahpuid álggaheapmi Johkamohkis váikkuhii munnje dieinna lágiin, ahte ovdánin doppe issorasat eandaliige duojis, danin go doppe ledje sápmelaš oahpaheaddjit.

source: Saamelaisena oleminen on suuri osa identiteettiäni.
sme: Sápmelašvuohta lea stuorra oassi mu identitehta.

source: Kasvoin siihen, enkä voisi kuvitella elämääni ilman saamelaisuutta.
sme: Bajásšadden dasa inge sáhtášii govahallat iežan eallima sápmelašvuođa haga.

source: Saamelaisuuteni on vahvistunut paljon aloitettuani opiskelut Jokkmokkissa, sillä kuulen saamenkieltä päivittäin ja olen päässyt mukaan saamelaiskäsitöihin.
sme: Mu sámevuohta lea gievron olu dan maŋŋá go álggahin oahpuid Johkamohkis, daningo gulan sámegiela beaivválaččat ja lean beassán mielde sámedujiide.

source: Kotialueellani ei ole kovin montaa, jotka puhuvat saamenkieltä julkisesti.
sme: Mu ruovttuguovllus eai gávdno beare máŋga olbmo geat hállet sámegiela almmolaččat.

source: Minulle kieli on erittäin tärkeä ja toivon sen vahvistuvan tulevaisuudessa.
sme: Munnje giella lea hui dehálaš ja sávan dan nanosmuvvat boahttevuođas.

source: Uskon, että tulevaisuus näyttää hyvältä siltä kannalta, että saamenkielen vahvistamiseen saadaan paljon resursseja.
sme: Jáhkán, ahte boahttevuohta lea oalle buorre dan dáfus, ahte sámegielaid ealáskahttimii biddjojuvvojit ollu resurssat.

source: Nykypäivänä monet nuoret pyrkivät vahvistamaan kieltänsä, mutta selkeästi tarvitsemme enemmän.
sme: Dán áigge máŋggat nuorat geahččalit nanosmahttit iežaset giela, muhto mii čielgasit dárbbašit eanet.

source: Uskon ja toivon, että pystymme vahvistamaan saamenkieltä entistä enemmän tulevaisuudessa.
sme: Jáhkán ja sávan, ahte mii nagodit nannet sámegiela vel eanet boahttevuođas.

source: Uskon niin, sillä saamelaisilla on niin vahva yhteenkuuluvuuden tunne, vaikka meidät onkin jaettu neljään eri maahan.
sme: Jáhkán nu, danin go sápmelaččain lea nu nana oktiigullevašvuođa dovdu, vaikko mii leatge juhkkojuvvon njealji eará riikii.
